In [2]:
import numpy as np
import pandas as pd

# 1.Pandas data series

### 1.1 Create data series from python list and specify index

In [6]:
data = [5,6,3,4,1]
idx = ['no1', 'no2', 'no3', 'no4', 'no5']
ps = pd.Series(data, index=idx)
ps

no1    5
no2    6
no3    3
no4    4
no5    1
dtype: int64

### 1.2 Create data series from python dictionary

In [8]:
scores = {'Kate': 99, 'Aoy': 100, 'Jane': 87, 'Arther': 84}
ps = pd.Series(scores)
ps

Kate       99
Aoy       100
Jane       87
Arther     84
dtype: int64

### 1.3 Accessing data series by index and index slicing

In [86]:
# By index
cmd = 'ps["Kate"]'
f'Accessing by specify index {cmd} then we get: {ps["Kate"]}'

'Accessing by specify index ps["Kate"] then we get: 99'

In [100]:
# By slicing index
scmd = 'ps[2:]'
f'By slicing index {scmd} we will get {ps[2:]}' # Index 2 which is Jane to the last index which is Arther

'By slicing index ps[2:] we will get Jane      87\nArther    84\ndtype: int64'

# 2.Pandas dataframe

### 2.1 Create dataframe fro 1 dimensional list

In [67]:
data = ['Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday']
cols = ['Day']
df = pd.DataFrame(data, columns=cols) # Specify column name
df

         Day
0     Sunday
1     Monday
2    Tuesday
3  Wednesday
4   Thursday
5     Friday
6   Saturday

### 2.2 Create dataframe from metric

In [49]:
data = [
    [1, 2, 3],
    [4, 5, 6,],
    [7, 8, 9]
]

cols = ['col1', 'col2', 'col3']
df = pd.DataFrame(data, columns=cols) # Specify columns name
df

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

### 2.3 Create dataframe from multiple list

In [53]:
names = ['John', 'Jane', 'Sam']
ages = [35, 40, 29]
programing = ['Python', 'R', 'Rust']
df = pd.DataFrame(zip(names, ages, programing), columns=['Name', 'Age', 'Programing Language'])
df

   Name  Age Programing Language
0  John   35              Python
1  Jane   40                   R
2   Sam   29                Rust

### 2.4 Create dataframe from 2 dimensional list, each inner item is row in dataframe

In [55]:
data = [['John', 35, 'Python'], ['Jane', 40, 'R'], ['Sam', 29, 'Rust']]
df = pd.DataFrame(data, columns=['Name', 'Age', 'Programing Language'])
df

   Name  Age Programing Language
0  John   35              Python
1  Jane   40                   R
2   Sam   29                Rust

### 2.5 Create dataframe from python list of dictionary

In [103]:
data = [
    {'Name': 'John', 'Age':35, 'Programing Language': 'Python' },
    {'Name': 'Jane', 'Age': 40, 'Programing Language': 'R'},
    {'Name': 'Sam', 'Age': 29, 'Programing Language': 'Rust'},
]

df = pd.DataFrame(data)
df

   Name  Age Programing Language
0  John   35              Python
1  Jane   40                   R
2   Sam   29                Rust

In [107]:
# Set index by using name

df.set_index(df.Name, inplace=True)
df

      Name  Age Programing Language
Name
John  John   35              Python
Jane  Jane   40                   R
Sam    Sam   29                Rust